public class Q2 {
    //{لتنفيذ طريقة size() في فئة
    // DoublyLinkedList دون الاحتفاظ بحجم القائمة كمتغير فردي، يمكننا استخدام خوارزمية تعيد حجم القائمة عن طريق الانتقال عبر العقد المتصلة والعد للعقد.

        //وفيما يلي الخوارزمية لتنفيذ طريقة size():

        //1. قم بتعيين متغير يعد عدد العقد في القائمة وقم بتعيينه بقيمة الصفر.

        //2. قم بتعيين مؤشر للعقدة الأولى في القائمة.

        //3. استخدم حلقة للانتقال عبر العقد المتصلة وعد العقد.

       // 4. في كل تكرار من الحلقة، قم بزيادة قيمة المتغير بواحد وانتقل إلى العقدة التالية.

        //5. استمر في الحلقة حتى يصل المؤشر إلى نهاية القائمة.

        //6. إرجاع قيمة المتغير التي تمت زيادتها والتي تمثل حجم القائمة.

      //  وفيما يلي تنفيذ الخوارزمية في شكل الكود:

   // java
        public int size() {
        int count = 0;
        Node<E> x = head.getNext();

        while (x!= trailer) {
            count++;
            x = x.getNext();
        }

        return count;
    }


      //  باستخدام هذه الخوارزمية، يمكننا تنفيذ طريقة size()
    // في فئة DoublyLinkedList. ستنتقل الحلقة عبر العقد المتصلة وتعد العقد وتزيد قيمة المتغير بواحد في كل تكرار
    // . ستستمر الحلقة حتى يصل المؤشر إلى نهاية القائمة. يتم إرجاع قيمة المتغير التي تمت زيادتها والتي تمثل حجم القائمة.
    }

}
